import spacy
from spacy.tokens import Doc

nlp_ru = spacy.load('ru_core_news_lg')

def __find_name(doc: Doc) -> list[str]:
    names = []
    skip_iteration = False
    for i in range(len(doc.ents)):
        if skip_iteration:
            skip_iteration = False
            continue
        ent = doc.ents[i]
        if ent.label_ != 'PER':
            continue
        if i == len(doc.ents):
            names.append(ent.text)

        next_ent = doc.ents[i + 1]
        # Sometimes it handles surname and name separately, so find if the same tokens are near and combine
        if next_ent.label_ == 'PER' and (next_ent.start == ent.end or next_ent.start == ent.end + 1):
            names.append(f"{ent.lemma_} {next_ent.lemma_}")
            skip_iteration = True
        else:
            names.append(ent.lemma_)
    return names



def get_proper_name(text: str) -> tuple[list[str], list[str]]:
    doc_ru = nlp_ru(text)
    orgs = [ent.lemma_ for ent in doc_ru.ents if ent.label_ == "ORG"]
    names = __find_name(doc_ru)
    return orgs, names



if __name__ == '__main__':

    text = """На прошлой неделе Петрова Николая Александровича позвали на мероприятия культурно-просветительное 
    объединения "АртПланета" для участия в конференции, посвященной инновациям в искусстве. Также, на этом мероприятии 
    присутствовала Иванова Ольга Сергеевна, которая выступала с докладом от имени компании "Фирма Разработок". В ходе 
    конференции, Дмитрий Николаевич Кузнецов из корпорации "Систем" представил новый проект, направленный на развитие 
    творческих способностей у молодежи. Этот проект также получил поддержку от Ассоциации Проектов и холдинга "Программ". 
    В завершение мероприятия, представители Государственного молодежного театра "Звездный свет" организовали постановку, 
    в которой участвовали дети из Регионального детского хора "Сказка". Особое внимание было уделено выступлению Сидорова 
    Михаила Владимировича, который сыграл одну из главных ролей. На следующий день, Смирнов Александр Михайлович провел 
    семинар для участников Объединения творческой молодежи "Энергия идеи", где обсуждались новые подходы к развитию 
    креативных индустрий. Присутствующие, включая Лебедева Владимира Ивановича, отметили важность взаимодействия между 
    различными организациями, такими как компания "Инноваций" и культурно-просветительное объединение "АртПланета". Таким 
    образом, конференция стала важным шагом на пути к укреплению сотрудничества между различными творческими и 
    инновационными организациями. На прошлой неделе Петров Николай Александрович посетил культурно-просветительное 
    объединение "АртПланета" для участия в конференции, посвященной инновациям в искусстве. Также, на этом мероприятии 
    присутствовала Иванова Ольга Сергеевна, которая выступала с докладом от имени компании "Фирма Разработок". В ходе 
    конференции, Дмитрий Николаевич Кузнецов из корпорации "Систем" представил новый проект, направленный на развитие 
    творческих способностей у молодежи. Этот проект также получил поддержку от Ассоциации Проектов и холдинга "Программ". 
    В завершение мероприятия, представители Государственного молодежного театра "Звездный свет" организовали постановку, 
    в которой участвовали дети из Регионального детского хора "Сказка". Особое внимание было уделено выступлению Сидорова 
    Михаила Владимировича, который сыграл одну из главных ролей. На следующий день, Смирнов Александр Михайлович провел 
    семинар для участников Объединения творческой молодежи "Энергия идеи", где обсуждались новые подходы к развитию 
    креативных индустрий. Присутствующие, включая Лебедева Владимира Ивановича, отметили важность взаимодействия между 
    различными организациями, такими как компания "Инноваций" и культурно-просветительное объединение "АртПланета". Таким 
    образом, конференция стала важным шагом на пути к укреплению сотрудничества между различными творческими и 
    инновационными организациями."""

    # Web version showing found words
    # from spacy import displacy
    # displacy.serve(nlp_ru(text), style="ent")

    orgs, names = get_proper_name(text)
    print(orgs)
    print(names)

